/*
 * SharpDevelopによって生成
 * 日付: 2017/09/20
 * 時刻: 22:31
 * 
 * このテンプレートを変更する場合「ツール→オプション→コーディング→標準ヘッダの編集」
 */
using System;

//クラスの前にはその説明を書いたほうがいい

//「///」ではじまるコメントはC#では特別な意味を持つ
//またあとでね

///<summary>
///コメント付けのプログラム
///ここでは例として配列で与えられたデータ列の平均値と分散を求めて表示する。
///</summary>

class Lesson1_1
{
	static void Main()
	{
		//変数名のあとに変数の説明を書いたりすることも
		//本当は、コメントが無くても意味のわかる変数名をつけるべき
		
		var detaSource = new[] {
			455, 58, 8, 7, 987, 56, 2 , 64 , 698, 79,
			98, 79, 45, 465, 167, 97, 94, 657, 237, 587,
			687, 654, 647, 4, 654, 984, 8, 489, 7, 22}; //データ列
		double mean; //平均値
		double variance; //分散
		
	}
}